<?php

return [
    'account-overview' => 'نظرة عامة على الحساب',
    'twofactor-messagebox' => 'يجب أن يتم تمكين المصادقة الثنائية في حسابك حتى تتمكن من المتابعة.',
    'apikey' => 'API مفتاح',
    'sshkey' => 'SSH مفتاح',

    'update-password' => [
        'current' => 'كلمة المرور الحالية',
        'new' => 'كلمة المرور الجديدة',
        'requirements' => 'يجب أن تتكون كلمة المرور الجديدة من 8 أحرف على الأقل وأن تكون فريدة لهذا الموقع.',
        'confirm' => 'تأكيد كلمة المرور الجديدة',
        'update' => 'تطوير كلمة المرور',
    ],

    'update-email' => [
        'isUpdated' => 'لقد تم تحديث بريدك الإلكتروني الأساسي',
        'update' => 'تحديث البريد الإلكتروني',
        'email' => 'بريد إلكتروني',
        'confirm' => 'تأكيد كلمة المرور',
    ],

    'appearance' => [
        'title' => 'المظهر',
        'lightDarkMode' => 'وضع فاتح/غامق',
        'light' => 'فاتح',
        'dark' => 'غامق',
        'language' => 'لغة اللوحة',
        'panel-sounds' => 'أصوات اللوحة',
        'on' => 'تشغيل',
        'off' => 'إيقاف',
    ],

    'twofactor' => [
        'title' => 'المصادقة الثنائية',
        'isEnabled' => 'التحقق بخطوتين يعمل حاليًا في حسابك.',
        'isDisabled' => 'لم يتم تمكين التحقق بخطوتين حاليًا في حسابك. انقر فوق الزر أدناه لبدء تكوينه.',
        'disable' => 'تعطيل الخطوتين',
        'enable' => 'تمكين الخطوتين',
        
        'disable-dialog' => [
            'password' => 'كلمة المرور',
            'cancel' => 'إلغاء',
            'must-enter-password' => 'يجب عليك إدخال كلمة مرور حسابك للمتابعة.',
            'disable' => 'تعطيل',
        ],

        'setup-dialog' => [
            'description' => 'قم بمسح رمز الاستجابة السريعة أعلاه باستخدام تطبيق المصادقة المكون من خطوتين الذي تختاره. ثم أدخل الرمز المكون من 6 أرقام الذي تم إنشاؤه في الحقل أدناه.',
            'account-password' => 'كلمة مرور الحساب',
            'qrcode-loading' => 'في انتظار تحميل رمز الاستجابة السريعة...',
            'enter-6digit-password' => 'يجب عليك إدخال الرمز المكون من 6 أرقام وكلمة المرور الخاصة بك للمتابعة.',
            'enable' => 'تفعيل',
            'cancel' => 'إلغاء',
        ],
    ],

    'apiKey' => [
        'label' => 'الوصف',
        'description' => 'وصف لمفتاح API هذا.',
        'allowedIPs-label' => 'عناوين IP المسموح بها',
        'allowedIPs-description' => 'اتركه فارغًا للسماح لأي عنوان IP باستخدام مفتاح API هذا، وإلا قم بتوفير كل عنوان IP في سطر جديد.',
        'createButton' => 'إنشاء',

        'your-keys' => 'مفتاح API الخاص بك',
        'store-save' => 'يظهر أدناه مفتاح API الذي طلبته. يرجى تخزين هذا في مكان آمن، فلن يتم عرضه مرة أخرى.',
        'close' => 'إغلاق',

        'delete-api-key' => 'حذف مفتاح API',
        'delete-key' => 'حذف المفتاح',
        'all-requests-invalidated-1' => 'جميع الطلبات باستخدام',
        'all-requests-invalidated-2' => 'سيتم إبطال المفتاح.',
        'loading' => 'تحميل...',
        'no-key-found' => 'لا توجد مفاتيح API لهذا الحساب.',
        'last-used' => 'آخر أستخدام',
    ],

    'sshKey' => [
        'loading' => 'تحميل...',
        'no-key-found' => 'لا توجد مفاتيح SSH لهذا الحساب.',
        'added-on' => 'اضافه في',

        'createForm' => [
            'key-name' => 'اسم مفتاح SSH',
            'public-key' => 'Public مفتاح',
            'public-key-desc' => 'أدخل مفتاح SSH Public الخاص بك.',
            'save' => 'حفظ',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'حذف مفتاح SSH',
            'delete-key' => 'حذف المفتاح',
            'will-invalidate-1' => 'إزالة ال',
            'will-invalidate-2' => 'سيؤدي مفتاح SSH إلى إبطال استخدامه عبر اللوحة.',
        ],
    ],

    'recoveryTokensDialog' => [
        'title' => 'تم تمكين المصادقة بخطوتين',
        'description' => 'قم بتخزين الرموز أدناه في مكان آمن. إذا فقدت إمكانية الوصول إلى هاتفك، فيمكنك استخدام هذه الرموز الاحتياطية لتسجيل الدخول.',
        'alert' => 'لن يتم عرض هذه الرموز مرة أخرى.',
        'doneButton' => 'تم',
    ],
];
