<?php

return [
    'support' => 'مركز الدعم',

    'login' => [
        'title' => 'قم بتسجيل الدخول للمتابعة',
        'username-or-email' => 'اسم المستخدم أو البريد الالكتروني',
        'password' => 'كلمة المرور',
        'forgot-password' => 'نسيت كلمة المرور؟',
        'login' => 'تسجيل الدخول',

        'must-be-provided' => 'يجب توفير اسم المستخدم أو البريد الإلكتروني.',
        'please-enter-password' => 'الرجاء إدخال كلمة المرور الخاصة بحسابك',
    ],

    'forgot' => [
        'title' => 'اعادة تعيين كلمة المرور طلب',
        'email' => 'بريد إلكتروني',
        'email-description' => 'أدخل عنوان البريد الإلكتروني الخاص بحسابك لتلقي تعليمات حول إعادة تعيين كلمة المرور الخاصة بك.',
        'send-email' => 'ارسل بريد الكتروني',
        'return-to-login' => 'العودة لتسجيل الدخول',

        'a-valid-email-provided' => 'يجب توفير عنوان بريد إلكتروني صالح للمتابعة.',
    ],

    'device' => [
        'title' => 'نقطة تفتيش الجهاز',
        'recovery-code' => 'رمز الاسترداد',
        'authentication-code' => 'رمز الدخول',

        'continue' => 'يكمل',

        'lost-device' => 'لقد فقدت جهازي',
        'have-device' => 'لدي جهازي',

        'return-to-login' => 'العودة لتسجيل الدخول',

        'enter-one-of-recovery-codes' => 'أدخل أحد رموز الاسترداد التي تم إنشاؤها عند إعداد المصادقة الثنائية على هذا الحساب للمتابعة.',
        'enter-two-factor' => 'أدخل الرمز الثنائي الذي أنشأه جهازك',
    ],

    'reset' => [
        'title' => 'إعادة تعيين كلمة المرور',

        'email' => 'البريد إلكتروني',
        'password' => 'كلمة المرور',
        'confirm-password' => 'تأكيد كلمة المرور الجديدة',

        'return-to-login' => 'العودة لتسجيل الدخول',
        
        'password-required' => 'مطلوب كلمة مرور جديدة.',
        'at-least-8-characters' => 'يجب أن تتكون كلمة المرور الجديدة من 8 أحرف على الأقل.',
        'password-does-not-match' => 'كلمة المرور الجديدة غير متطابقة.',
    ]
];
