<?php

return [
    'backups' => 'النسخ الاحتياطية',
    'manage-backups' => 'إدارة النسخ الاحتياطية',
    'create-backup' => 'إنشاء نسخة احتياطية',
    'have-been-allocated' => 'تم إنشاء {{current}} من {{max}} نسخة احتياطية لهذا الخادم.',

    'name' => 'الاسم',
    'size' => 'الحجم',
    'creation-date' => 'تاريخ الإنشاء',
    'checksum' => 'التحقق',

    'failed' => 'فشل',
    'continue' => 'متابعة',

    'download' => 'تنزيل',
    'restore' => 'استعادة',
    'lock' => 'قفل',
    'unlock' => 'إلغاء القفل',
    'delete' => 'حذف',

    'limit-is-0' => 'لا يمكن إنشاء نسخ احتياطية لهذا الخادم لأن حد النسخ الاحتياطية تم تعيينه إلى 0.',
    'try-going-back' => 'يبدو أننا نفدنا من النسخ الاحتياطية لنعرضها لك، جرب العودة إلى الصفحة السابقة.',
    'no-backups' => 'يبدو أنه لا توجد نسخ احتياطية مخزنة حاليًا لهذا الخادم.',
    'no-longer-protected' => 'لن تكون هذه النسخة الاحتياطية محمية بعد الآن من الحذف التلقائي أو الحذف العرضي.',
    'your-server-will-be-stopped' => 'سيتم إيقاف خادمك. لن تكون قادرًا على التحكم في حالة الطاقة، أو الوصول إلى مدير الملفات، أو إنشاء نسخ احتياطية إضافية حتى اكتمال العملية.',
    'delete-all-files' => 'حذف جميع الملفات قبل استعادة النسخة الاحتياطية.',
    'permanent-operation' => 'هذا إجراء دائم. لا يمكن استعادة النسخة الاحتياطية بمجرد حذفها.',

    'create' => [
        'title' => 'إنشاء نسخة احتياطية للخادم',
        'backup-name' => 'اسم النسخة الاحتياطية',
        'backup-name-description' => 'إذا تم توفيره، يجب استخدامه للإشارة إلى هذه النسخة الاحتياطية.',
        'ignored-files-directories' => 'الملفات والمجلدات المتجاهلة',
        'ignored-files-directories-description' => ' أدخل الملفات أو المجلدات التي تجاهلها أثناء إنشاء هذه النسخة الاحتياطية. اتركه فارغًا لاستخدام محتويات ملف .pteroignore في جذر مجلد الخادم إذا وجد. يتم دعم توافق الرموز البارعة مع الملفات والمجلدات بالإضافة إلى نفي قاعدة بتمرير المسار بعلامة تعجب.',
        'locked' => 'مقفول',
        'locked-description' => 'يمنع حذف هذه النسخة الاحتياطية حتى يتم إلغاء القفل بشكل صريح.',
        'start' => 'بدء النسخ الاحتياطي',
    ]
];
