<?php

return [
'settings' => 'الإعدادات',

'sftp' => [
    'title' => 'تفاصيل SFTP',
    'server-address' => 'عنوان الخادم',
    'username' => 'اسم المستخدم',
    'description' => 'كلمة مرور SFTP هي نفس كلمة المرور التي تستخدمها للوصول إلى لوحة التحكم هذه.',
    'launch-sftp' => 'تشغيل SFTP',
],

'rename' => [
    'title' => 'تغيير تفاصيل الخادم',
    'server-name' => 'اسم الخادم',
    'server-description' => 'وصف الخادم',
    'save' => 'حفظ',
],

'debug' => [
    'title' => 'معلومات التصحيح',
    'node' => 'العقدة',
    'server-id' => 'معرف الخادم',
],

'reinstall' => [
    'title' => 'إعادة تثبيت الخادم',
    'reinstall-started' => 'بدأت عملية إعادة تثبيت الخادم الخاص بك.',
    'confirm-reinstallation' => 'تأكيد إعادة تثبيت الخادم',
    'yes-reinstall' => 'نعم، إعادة تثبيت الخادم',
    'are-you-sure' => 'سيتم إيقاف تشغيل الخادم الخاص بك وقد تحذف أو تعدل بعض الملفات خلال هذه العملية، هل أنت متأكد أنك تريد المتابعة؟',
    'desc-1' => 'سيتم إيقاف تشغيل الخادم الخاص بك ومن ثم إعادة تشغيل البرنامج التثبيت الذي قام بتعيينه أولاً.',
    'desc-2' => 'قد يتم حذف أو تعديل بعض الملفات خلال هذه العملية، يرجى أخذ نسخة احتياطية من بياناتك قبل المتابعة.',
    'reinstall-server' => 'إعادة تثبيت الخادم',
],
];
