<?php

return [
    'title' => 'المستخدمين',
    'manage-subusers' => 'إدارة المستخدمين الفرعيين',
    'new-user' => 'مستخدم جديد',

    'no-users' => 'يبدو أنه ليس لديك أي مستخدمين فرعيين.',

    'name' => 'اسم',
    'email' => 'البريد إلكتروني',
    '2FA-enabled' => '2FA تمكين',
    'creation-date' => 'تاريخ الإنشاء',
    'modify-permissions' => 'تعديل الأذونات',

    'user-email' => 'البريد الالكتروني للمستخدم',
    'user-email-description' => 'أدخل عنوان البريد الإلكتروني للمستخدم الذي ترغب في دعوته كمستخدم فرعي لهذا الخادم.',

    'modify-permissions-for' => 'تعديل الصلاحيات لـ',
    'view-permissions-for' => 'عرض الصلاحيات لـ',
    'create-new-subuser' => 'إنشاء مستخدم فرعي جديد',
    'must-not-exceed' => 'يجب ألا تتجاوز عناوين البريد الإلكتروني 191 حرفًا.',
    'valid-email' => 'يجب توفير عنوان بريد إلكتروني صحيح.',
    'save' => 'حفظ',
    'invite-user' => 'دعوة مستخدم',

    'only-permissions-you-assigned' => 'يمكن تحديد صلاحيات التي تم تعيينها لحسابك حاليًا عند إنشاء أو تعديل مستخدمين آخرين.',

    'delete-this-subuser' => 'حذف هذا المستخدم الفرعي؟',
    'yes-remove' => 'نعم، قم بإزالة المستخدم الفرعي',
    'are-you-sure-to-remove' => 'هل أنت متأكد أنك تريد إزالة هذا المستخدم الفرعي؟ سيتم سحب جميع صلاحياته فورًا.'
];
